"use strict";

const userAge = +prompt("Введите ваш возраст");

if (userAge < 12) {
    alert("Рекомендуем посмотреть мультфильмы!")
} else if (userAge >= 12 && userAge <= 17) {
    const userOpinion = confirm("Любите ли вы фантастику?");
    if (userOpinion == true) {
        alert(`Рекомендуем фильм "Интерстеллар" или "Звездные войны" `);
    } else {
        alert("Рекомендуем комедию или подростковый сериал");
    }
} else if (userAge >= 18) {
    alert("Добро пожаловать в раздел для взрослых!Можете выбрать любой фильм");
} else {
    alert("Введите корректный формат данных(возраст ввиде цифры/числа)");
}